In [5]:
import pandas as pd

series y dataframe

In [6]:
#serie
numero = [2,3,4,5,6]
print(numero)             #imprime el arrego de numero
type(numero)
serie = pd.Series(numero)   #trasforma el array en una series de pandas contine indices y los datos
serie, type(serie)

[2, 3, 4, 5, 6]

(0    2
 1    3
 2    4
 3    5
 4    6
 dtype: int64,
 pandas.core.series.Series)

In [7]:
data = {
    'Nombre':['Blas','Bruno','Marina','Carlos','Pedro','Luis'],
    'Edad' :[4,39,39,18,77,33],
    'Ciudad':['Tucuman','Cordoba','Jujuy','Salta','Mendoza','Chaco']
}           #diccionario creado
data

{'Nombre': ['Blas', 'Bruno', 'Marina', 'Carlos', 'Pedro', 'Luis'],
 'Edad': [4, 39, 39, 18, 77, 33],
 'Ciudad': ['Tucuman', 'Cordoba', 'Jujuy', 'Salta', 'Mendoza', 'Chaco']}

In [8]:
df = pd.DataFrame(data)  #pasamos de diccionario a un dataframe
df, type(df)      #con el tipo podemos ver que es una Dataframe

(   Nombre  Edad   Ciudad
 0    Blas     4  Tucuman
 1   Bruno    39  Cordoba
 2  Marina    39    Jujuy
 3  Carlos    18    Salta
 4   Pedro    77  Mendoza
 5    Luis    33    Chaco,
 pandas.core.frame.DataFrame)

In [9]:
type(df)

pandas.core.frame.DataFrame

Manipulacion de los datos

In [10]:
#seleccionar una sola columna nombre
nombres= df['Nombre']
nombres, type(nombres)   #podemos ver que el apartado nombre es una serie de pandas

(0      Blas
 1     Bruno
 2    Marina
 3    Carlos
 4     Pedro
 5      Luis
 Name: Nombre, dtype: object,
 pandas.core.series.Series)

In [11]:
# filtramos mas de una columna
variascolumnas = df[['Nombre','Edad']]
variascolumnas, type(variascolumnas)

(   Nombre  Edad
 0    Blas     4
 1   Bruno    39
 2  Marina    39
 3  Carlos    18
 4   Pedro    77
 5    Luis    33,
 pandas.core.frame.DataFrame)

In [12]:
#filtrar por indice en este caso por el indice 1
indice = df.loc[1]
indice

Nombre      Bruno
Edad           39
Ciudad    Cordoba
Name: 1, dtype: object

In [15]:
#filtramos por condiciones
df[df['Edad']> 18]

   Nombre  Edad   Ciudad
1   Bruno    39  Cordoba
2  Marina    39    Jujuy
4   Pedro    77  Mendoza
5    Luis    33    Chaco

In [18]:
#filtrar por que su nombre comience con B
filtro = (df['Edad']>17) & (df['Nombre'].str.startswith('B'))
df[filtro]

  Nombre  Edad   Ciudad
1  Bruno    39  Cordoba

In [20]:
#query con pandas
df.query('Edad < 17')

  Nombre  Edad   Ciudad
0   Blas     4  Tucuman

In [21]:
df.query('Edad > 22')

   Nombre  Edad   Ciudad
1   Bruno    39  Cordoba
2  Marina    39    Jujuy
4   Pedro    77  Mendoza
5    Luis    33    Chaco

In [23]:
#buscar por nombre especifico
df[df['Nombre'].isin(['Marina','Luis','Mario','Blas'])]

   Nombre  Edad   Ciudad
0    Blas     4  Tucuman
2  Marina    39    Jujuy
5    Luis    33    Chaco

In [26]:
#filtar por nombre que tengas 5 caracteres mediante una funcion
def long_5(nombre):
    return len(nombre) == 5
df[df['Nombre'].apply(long_5)]

  Nombre  Edad   Ciudad
1  Bruno    39  Cordoba
4  Pedro    77  Mendoza

In [ ]:
#filtrar por condiciones entre
df[df['Edad'].between(28,50)]

   Nombre  Edad   Ciudad
1   Bruno    39  Cordoba
2  Marina    39    Jujuy
5    Luis    33    Chaco